{
  "post_stream": {
    "posts": [
      {
        "id": 20110,
        "name": "",
        "username": "Apricus",
        "avatar_template": "/user_avatar/discuss.criticalfallibilism.com/apricus/{size}/855_2.png",
        "created_at": "2026-01-11T02:07:13.840Z",
        "cooked": "<p>I have not watched KPop Demon Hunters. I enjoyed this blog post because it raised a question I’ve never thought of before: Why do people like a movie that espouses values that go against how they actually behave?</p>\n<p>I have noticed that I also like some things but don’t always behave in a way that fits that value. Maybe I’m incongruent? Maybe people are drawn to ideals and things they want to be like but currently are not. Aspirational values.</p>\n<p>But in the context of KPop Demon Hunters I could imagine a scenario where e.g. a teen girl watches and likes it, but she’s popular in high school and along with her popular friends bullies a less popular girl who has been deemed weird by them. I don’t know how to reconcile that contradiction. Maybe there’s a gap between the girl’s understanding of the values in the movie vs. the decisions she faces in real life?</p>\n<p>It might also be that movies and media in general make it seem easier to be nice than it actually is in real life. Perhaps it idealizes or romanticizes the actual execution of those values.</p>\n<p>The blog post touches on all of these thoughts I had and more: (below quote from the blog post)</p>\n<blockquote>\n<p>So of course people aren’t great at actually being nice and accepting in the way KDH says to. Even in KDH itself, there are conflicting themes. KDH normalizes a small number of people being ultra-popular while ignoring that some people in the huge audience can also sing well but will never get similar recognition for their talent. And either that’s unfair or else the less popular people have less merit in which case being dismissive of them in some ways is valid.</p>\n<p>KDH normalizes being accepting of flaws from ultra-popular people. It illustrates that. It doesn’t illustrate any regular fans in the crowd having flaws and being accepted anyway. It doesn’t even illustrate people in the crowd with no notable flaws being important, interesting or talented, or getting much attention.</p>\n</blockquote>\n<p>Popularity and status in general are interesting topics to me and I like reading blog posts that touch on them or help me understand them better. It’s true in real life too that many talented people never get famous, while some people less talented than them do get famous.</p>\n<p>Another quote:</p>\n<blockquote>\n<p>A important consideration is that if everyone dismisses the same stuff, instead of using independent judgment, then some ideas get a lot of attention while others get none. A million intellectuals have time to investigate over a million ideas. My view is that people should pay more attention to which ideas are have already received engagement. In other words, if someone wrote down a refutation of an idea (and is handling followup questions and criticisms about their refutation), then I don’t need to investigate it myself since it’s already being handled. But if no one is looking at an idea, I should be more open to it. If lots of people had this attitude, then the coverage of ideas that get attention could be better instead of being overly focused on a small number of popular ideas (paralleling how a small number of pop stars get a ton of attention while a lot of other music gets ignored, some of which is actually good).</p>\n</blockquote>\n<p>I was a bit confused by this at first because it said people should pay more attention to which ideas have already received engagement. I interpreted that as prioritizing those ideas or viewing them as worth more attention, analysis, or investigation. But I think the next part about being more open to ideas no one is looking at actually means that people should pay attention to ideas receiving attention so that they can actually focus more on the other ideas that aren’t receiving attention, since they aren’t getting intellectual attention or debate. This way more ideas get worked on and we’d make more progress overall. I find this idea interesting. It’s like each person taking responsibility for intellectual progress. When they see an idea already being handled, they move on until they find one that nobody has picked up, and if it interests them, they pick it up and write about it or respond to it. I like it!</p>\n<p>And near the end of the post:</p>\n<blockquote>\n<p>I think there’s something interesting about people who live in a society with tons of meanness and dismissiveness watching yet another movie saying not to do that, and liking it, while knowing that people are going to keep doing it anyway. A lot of the people who like the movie will do the thing the movie says not to do, but instead of being offended they just nod along and agree then don’t act accordingly.</p>\n</blockquote>\n<p>This is interesting to me too. It also seems really common. It’s like content that shows us what’s ideal and possible and a possible better way of being strikes some part of us that wants to experience that, even if just through a screen temporarily, and maybe we suspend disbelief for a bit even if we might rationally know that the real world won’t meaningfully be different from the values we’re attracted to in the movie.</p>\n<p>Personally I know I’m pretty idealistic but I’ve also grown somewhat jaded from trying to apply the ideals and failing or running into conflicts in life that I didn’t expect. Now I think it’s normal for it to be challenging to live a life according to my values and that it won’t always be easy to make the right choice. Media like this might make it seem unrealistically easy or natural when in reality there’ll be moral dilemmas and internal conflict when it comes to these decisions.</p>",
        "post_number": 4,
        "post_type": 1,
        "posts_count": 30,
        "updated_at": "2026-01-11T02:07:13.840Z",
        "reply_count": 5,
        "reply_to_post_number": null,
        "quote_count": 0,
        "incoming_link_count": 0,
        "reads": 13,
        "readers_count": 12,
        "score": 27.6,
        "yours": false,
        "topic_id": 2144,
        "topic_slug": "kpop-demon-hunters",
        "display_username": "",
        "primary_group_name": null,
        "flair_name": null,
        "flair_url": null,
        "flair_bg_color": null,
        "flair_color": null,
        "flair_group_id": null,
        "badges_granted": [],
        "version": 1,
        "can_edit": false,
        "can_delete": false,
        "can_recover": false,
        "can_see_hidden_post": false,
        "can_wiki": false,
        "read": true,
        "user_title": null,
        "bookmarked": false,
        "actions_summary": [],
        "moderator": false,
        "admin": false,
        "staff": false,
        "user_id": 39,
        "hidden": false,
        "trust_level": 2,
        "deleted_at": null,
        "user_deleted": false,
        "edit_reason": null,
        "can_view_edit_history": true,
        "wiki": false,
        "mentioned_users": [],
        "post_url": "/t/kpop-demon-hunters/2144/4",
        "can_accept_answer": false,
        "can_unaccept_answer": false,
        "accepted_answer": false,
        "topic_accepted_answer": null
      },
      {
        "id": 20104,
        "name": "anonymous45",
        "username": "anonymous45",
        "avatar_template": "/letter_avatar_proxy/v4/letter/a/a87d85/{size}.png",
        "created_at": "2026-01-11T00:34:09.938Z",
        "cooked": "<p>I watched the film last night. On the whole I liked it. Some spoilers below.</p>\n<p>One thing I wonder about is how much people pick up on, respond to, or internalize less explicit parts of films like this. If people subconsciously respond less to the explicit parts and more to the implicit parts, it might explain why media that moralizes is not particularly effective.</p>\n<p>For example, when the saja boys are introduced, zoey and mira are shown to be infatuated immediately, they’re then rejected and immediately turn hostile. I don’t think it was the intention of the writers to glorify that pattern of behavior, but that element isn’t really resolved. Arguably it’s still present in the climax since it’s played for laughs. If the roles were reversed it would be seen as incel-type behavior. There’s also some LoLE dynamics to flip the social hierarchy which I think kids will pick up on.</p>",
        "post_number": 3,
        "post_type": 1,
        "posts_count": 30,
        "updated_at": "2026-01-11T00:34:09.938Z",
        "reply_count": 3,
        "reply_to_post_number": null,
        "quote_count": 0,
        "incoming_link_count": 0,
        "reads": 13,
        "readers_count": 12,
        "score": 17.6,
        "yours": false,
        "topic_id": 2144,
        "topic_slug": "kpop-demon-hunters",
        "display_username": "anonymous45",
        "primary_group_name": null,
        "flair_name": null,
        "flair_url": null,
        "flair_bg_color": null,
        "flair_color": null,
        "flair_group_id": null,
        "badges_granted": [],
        "version": 1,
        "can_edit": false,
        "can_delete": false,
        "can_recover": false,
        "can_see_hidden_post": false,
        "can_wiki": false,
        "read": true,
        "user_title": null,
        "bookmarked": false,
        "actions_summary": [],
        "moderator": false,
        "admin": false,
        "staff": false,
        "user_id": 84,
        "hidden": false,
        "trust_level": 1,
        "deleted_at": null,
        "user_deleted": false,
        "edit_reason": null,
        "can_view_edit_history": true,
        "wiki": false,
        "mentioned_users": [],
        "post_url": "/t/kpop-demon-hunters/2144/3",
        "can_accept_answer": false,
        "can_unaccept_answer": false,
        "accepted_answer": false,
        "topic_accepted_answer": null
      },
      {
        "id": 20102,
        "name": "Nihal Noorunnabi",
        "username": "Eternity",
        "avatar_template": "/user_avatar/discuss.criticalfallibilism.com/eternity/{size}/5535_2.png",
        "created_at": "2026-01-10T20:59:07.236Z",
        "cooked": "<aside class=\"quote no-group quote-modified\" data-username=\"Elliot\" data-post=\"1\" data-topic=\"2144\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt=\"\" width=\"24\" height=\"24\" src=\"https://discuss.criticalfallibilism.com/user_avatar/discuss.criticalfallibilism.com/elliot/48/14_2.png\" class=\"avatar\"> Elliot:</div>\n<blockquote>\n<p>I find it interesting that people love this theme while not doing it very well. Being mean and dismissive of people for being different remains widespread despite all the messaging saying not to. Somehow, many people don’t listen to the message while also liking the message. Maybe they like to pretend to listen to it – to pretend to be nicer than they are. Or maybe they’re trying to listen but they’re bad at it. Or a mix.</p>\n</blockquote>\n</aside>\n<p>~yeah idk how people process this message. a coworker of mine is fairly political (though he limits how much he brings up politics at work) and he’s mentioned stuff about how people are intolerant, especially, in his eyes, conservatives. he has shared a sentiment about being nicer to people and stuff. he contradicts himself a lot though on this. a recent example: I watched a video about sports betting from coffeezilla about sports betting I think. i talked about it with him and mentioned how i thought it was kinda sad that people were ruining their lives over this. he agreed, partially, but he didn’t care for the stupid frat boys and stuff doing it. to him those guys kinda had it coming to them and deserved to have their lives ruined. idk, seems kinda mean and not in line with being kind to others.</p>\n<aside class=\"quote no-group quote-modified\" data-username=\"Elliot\" data-post=\"1\" data-topic=\"2144\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt=\"\" width=\"24\" height=\"24\" src=\"https://discuss.criticalfallibilism.com/user_avatar/discuss.criticalfallibilism.com/elliot/48/14_2.png\" class=\"avatar\"> Elliot:</div>\n<blockquote>\n<p>People being different is pretty much the only thing people are dismissed for. What else would you reject someone for? People are intolerant of disagreement, not agreement. People are intolerant of differences, not sameness (with some special exceptions like copying someone’s outfit or cultural appropriation).</p>\n</blockquote>\n</aside>\n<p>Hmm. That makes sense.</p>\n<aside class=\"quote no-group quote-modified\" data-username=\"Elliot\" data-post=\"1\" data-topic=\"2144\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt=\"\" width=\"24\" height=\"24\" src=\"https://discuss.criticalfallibilism.com/user_avatar/discuss.criticalfallibilism.com/elliot/48/14_2.png\" class=\"avatar\"> Elliot:</div>\n<blockquote>\n<p>KDH normalizes being accepting of flaws from ultra-popular people. It illustrates that. It doesn’t illustrate any regular fans in the crowd having flaws and being accepted anyway. It doesn’t even illustrate people in the crowd with no notable flaws being important, interesting or talented, or getting much attention.</p>\n</blockquote>\n</aside>\n<p>I wonder if they think that regular people with flaws are viewed as fine and are accepted.</p>\n<aside class=\"quote no-group quote-modified\" data-username=\"Elliot\" data-post=\"1\" data-topic=\"2144\">\n<div class=\"title\">\n<div class=\"quote-controls\"></div>\n<img alt=\"\" width=\"24\" height=\"24\" src=\"https://discuss.criticalfallibilism.com/user_avatar/discuss.criticalfallibilism.com/elliot/48/14_2.png\" class=\"avatar\"> Elliot:</div>\n<blockquote>\n<p>I think there’s something interesting about people who live in a society with tons of meanness and dismissiveness watching yet another movie saying not to do that, and liking it, while knowing that people are going to keep doing it anyway. A lot of the people who like the movie will do the thing the movie says not to do, but instead of being offended they just nod along and agree then don’t act accordingly.</p>\n</blockquote>\n</aside>\n<p>another example i remembered, this time from a podcast i watch a lot. one of the co-hosts in one episode shared a sentiment about how people don’t listen to each other, just get mad and are intolerant of other ideas. that same co-host in a similar discussion (some episodes later) argued against a different co-host who actually tries to embody that. criticizing him by saying that this is how we get conspiracy theorists and stuff and making it clear he’s openly hostile and not interested in listening to what he thinks are bad ideas</p>",
        "post_number": 2,
        "post_type": 1,
        "posts_count": 30,
        "updated_at": "2026-01-10T20:59:07.236Z",
        "reply_count": 0,
        "reply_to_post_number": null,
        "quote_count": 1,
        "incoming_link_count": 0,
        "reads": 14,
        "readers_count": 13,
        "score": 2.8,
        "yours": false,
        "topic_id": 2144,
        "topic_slug": "kpop-demon-hunters",
        "display_username": "Nihal Noorunnabi",
        "primary_group_name": null,
        "flair_name": null,
        "flair_url": null,
        "flair_bg_color": null,
        "flair_color": null,
        "flair_group_id": null,
        "badges_granted": [],
        "version": 1,
        "can_edit": false,
        "can_delete": false,
        "can_recover": false,
        "can_see_hidden_post": false,
        "can_wiki": false,
        "read": true,
        "user_title": "",
        "bookmarked": false,
        "actions_summary": [],
        "moderator": false,
        "admin": false,
        "staff": false,
        "user_id": 151,
        "hidden": false,
        "trust_level": 2,
        "deleted_at": null,
        "user_deleted": false,
        "edit_reason": null,
        "can_view_edit_history": true,
        "wiki": false,
        "mentioned_users": [],
        "post_url": "/t/kpop-demon-hunters/2144/2",
        "can_accept_answer": false,
        "can_unaccept_answer": false,
        "accepted_answer": false,
        "topic_accepted_answer": null
      },
      {
        "id": 20089,
        "name": "",
        "username": "Elliot",
        "avatar_template": "/user_avatar/discuss.criticalfallibilism.com/elliot/{size}/14_2.png",
        "created_at": "2026-01-08T19:23:48.342Z",
        "cooked": "<hr>\n<small>This is a companion discussion topic for the original entry at <a href=\"https://curi.us/2607-kpop-demon-hunters\">https://curi.us/2607-kpop-demon-hunters</a></small>",
        "post_number": 1,
        "post_type": 1,
        "posts_count": 30,
        "updated_at": "2026-01-08T19:23:48.342Z",
        "reply_count": 5,
        "reply_to_post_number": null,
        "quote_count": 0,
        "incoming_link_count": 5,
        "reads": 13,
        "readers_count": 12,
        "score": 67.6,
        "yours": false,
        "topic_id": 2144,
        "topic_slug": "kpop-demon-hunters",
        "display_username": "",
        "primary_group_name": null,
        "flair_name": null,
        "flair_url": null,
        "flair_bg_color": null,
        "flair_color": null,
        "flair_group_id": null,
        "badges_granted": [],
        "version": 1,
        "can_edit": false,
        "can_delete": false,
        "can_recover": false,
        "can_see_hidden_post": false,
        "can_wiki": false,
        "link_counts": [
          {
            "url": "https://curi.us/2607-kpop-demon-hunters",
            "internal": false,
            "reflection": false,
            "title": "KPop Demon Hunters",
            "clicks": 8
          }
        ],
        "read": true,
        "user_title": "",
        "bookmarked": false,
        "actions_summary": [
          {
            "id": 2,
            "count": 1
          }
        ],
        "moderator": true,
        "admin": true,
        "staff": true,
        "user_id": 1,
        "hidden": false,
        "trust_level": 4,
        "deleted_at": null,
        "user_deleted": false,
        "edit_reason": null,
        "can_view_edit_history": true,
        "wiki": false,
        "mentioned_users": [],
        "post_url": "/t/kpop-demon-hunters/2144/1",
        "can_accept_answer": false,
        "can_unaccept_answer": false,
        "accepted_answer": false,
        "topic_accepted_answer": null,
        "can_vote": false
      }
    ]
  },
  "id": 2144
}